Merge pull request #176 from lgcorzo/fix/ast-generator-plantuml-and-links-7208427788207876030
Update AST generator to use PlantUML and standard markdown links
